现在需要你搭建一个rust web项目架构框架，分为开发环境和生产环境，数据库要求提前做好多兼容性例如 mysql postgresql，但是目前使用postgresq，目前数据库路径分为开发环境和生产环境，
开发：postgres:postgres@47.92.117.121:5432/electricity-dev
生产：postgres:postgres@47.92.117.121:5432/electricity-pro
目前预计采用框架如下
后端核心框架	Axum
后端 Web 服务器	Tokio
后端安全认证	jsonwebtoken + axum-login / 自定义Tower中间件
数据库交互 (ORM)	Diesel + diesel-async
项目依赖管理	Cargo
数据库迁移	diesel_cli
数据验证/序列化	Serde + validator

配置文件要求采用项目级别的toml文件，不要传统的.env环境配置文件，目前不需要写docker文件，只需要确保环境准确，且兼容开发环境喝生产环境
开发环境为windows，生产环境为linux，根据需求，选取合适的开发框架，只需要设计并搭建项目架构框架，不需要实际开发，成功完成架构框架搭建后，需要进行架构框架设计的相关记忆保存

根据描述，你需要先进行严谨且多轮的分析需求并思考，然后调用find_code_context工具查看相关项目结构，然后需要明确当前最新时间，确保后续得到的相关技术信息的时效性，然后根据时间和需求去调用网络搜索工具搜索，并优先搜索2025年的最新消息，同时调用context7 工具进行查询官方文档综合使用并分析问题并根据问题找到合适的方案解决问题，在使用context7查询官方文档时，如果没有，则选择搜索相关内容，并进行多轮严谨的分析，在深度需求分析、项目架构分析、技术调研和并调用find_code_context工具问题定位后，先不要进行代码的编写，先调用feedback mcp工具反馈，代码编写过程中要注意调用feedback mcp工具进行反馈，并即将准备进行详细具体的实施方案的设计，设计实施方案完毕调用feedback mcp工具反馈我让我确认实施方案，准备好实施方案后，开始设计此次修改的任务设计，并调用feedback mcp工具反馈我等待我确认，然后将任务写入任务系统，并且按照任务系统逐步执行任务。
需要全局注意代码的设计优雅性并符合优秀实践以及调用feedback反馈